soapTemplates/delDevice.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://www.cisco.com/prime/xsd/cp/v5" xmlns:ns2="http://www.cisco.com/prime/cp/v5" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <SOAP-ENV:Body>
    <ns2:deleteDevice>
      <ns2:context>
        <ns1:sessionId>{{ sessionId }}</ns1:sessionId>
      </ns2:context>
      <ns2:options></ns2:options>
      <ns2:deviceId>
        <ns1:macAddress>{{ cmac }}</ns1:macAddress>
      </ns2:deviceId>
    </ns2:deleteDevice>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
